massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1/main/app_main.cpp
// Advanced features
#define SCD40_CMD_PERSIST_SETTINGS            0x3615
#define SCD40_CMD_GET_SERIAL_NUMBER           0x3682
#define SCD40_CMD_PERFORM_SELF_TEST           0x3639
#define SCD40_CMD_PERFORM_FACTORY_RESET       0x3632
#define SCD40_CMD_REINIT                      0x3646

// Low power single shot (SCD41 only)
#define SCD40_CMD_MEASURE_SINGLE_SHOT         0x219d
#define SCD40_CMD_MEASURE_SINGLE_SHOT_RHT_ONLY 0x2196

// Initialize I2C master (new API)
static esp_err_t i2c_master_init(void)
{
    // Configure I2C master bus
    i2c_master_bus_config_t bus_config = {
        .i2c_port = I2C_MASTER_NUM,
        .sda_io_num = I2C_MASTER_SDA_IO,
        .scl_io_num = I2C_MASTER_SCL_IO,
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .flags = {
            .enable_internal_pullup = true,
        },
    };

    esp_err_t err = i2c_new_master_bus(&bus_config, &i2c_bus_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "I2C master bus creation failed: %s", esp_err_to_name(err));
        return err;
    }

    // Add SCD40 device to the bus
    i2c_device_config_t dev_config = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = SCD40_I2C_ADDR,
        .scl_speed_hz = I2C_MASTER_FREQ_HZ,
    };

    err = i2c_master_bus_add_device(i2c_bus_handle, &dev_config, &scd40_dev_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to add SCD40 device to I2C bus: %s", esp_err_to_name(err));
        return err;
    }

    ESP_LOGI(TAG, "I2C initialized: SDA=GPIO%d, SCL=GPIO%d", I2C_MASTER_SDA_IO, I2C_MASTER_SCL_IO);
    return ESP_OK;
}

// Send command to SCD40
esp_err_t scd40_send_command(uint16_t command)
{
    uint8_t cmd_buf[2];
    cmd_buf[0] = (command >> 8) & 0xFF;
    cmd_buf[1] = command & 0xFF;

    esp_err_t err = i2c_master_transmit(scd40_dev_handle, cmd_buf, 2, pdMS_TO_TICKS(1000));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "SCD40 command 0x%04x failed: %s", command, esp_err_to_name(err));
    }
    return err;
}

// Read data from SCD40 with CRC check (Sensirion CRC-8)
static uint8_t scd40_crc8(const uint8_t *data, size_t len)
{
    uint8_t crc = 0xFF;
    for (size_t i = 0; i < len; i++) {
        crc ^= data[i];
        for (uint8_t bit = 0; bit < 8; bit++) {
            if (crc & 0x80) {
                crc = (crc << 1) ^ 0x31;
            } else {
                crc = crc << 1;
            }
        }
    }
    return crc;
}

// Initialize SCD40 sensor
static esp_err_t scd40_init(void)
{
    ESP_LOGI(TAG, "Initializing SCD40 sensor...");

    // Stop any ongoing measurement
    scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
    vTaskDelay(pdMS_TO_TICKS(500));

    // Start periodic measurement
    esp_err_t err = scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start SCD40 periodic measurement");
        return err;
    }

    ESP_LOGI(TAG, "SCD40 periodic measurement started (readings every 5 seconds)");
    return ESP_OK;
}

// Read measurement from SCD40
static esp_err_t scd40_read_measurement(uint16_t *co2, float *temperature, float *humidity)
{
    uint8_t data[9];  // 3 words of 2 bytes + 1 CRC byte each

    // Send read command
    esp_err_t err = scd40_send_command(SCD40_CMD_READ_MEASUREMENT);
    if (err != ESP_OK) {
        return err;
    }

    // Wait for measurement to be ready (1ms should be enough)
    vTaskDelay(pdMS_TO_TICKS(1));

    // Read 9 bytes (3x [2 data bytes + 1 CRC])
    err = i2c_master_receive(scd40_dev_handle, data, 9, pdMS_TO_TICKS(1000));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to read SCD40 data: %s", esp_err_to_name(err));
        return err;
    }

    // Verify CRC for each word
    if (scd40_crc8(&data[0], 2) != data[2]) {
        ESP_LOGE(TAG, "SCD40 CRC error for CO2");
        return ESP_ERR_INVALID_CRC;
    }
    if (scd40_crc8(&data[3], 2) != data[5]) {
        ESP_LOGE(TAG, "SCD40 CRC error for temperature");
        return ESP_ERR_INVALID_CRC;
    }
    if (scd40_crc8(&data[6], 2) != data[8]) {
        ESP_LOGE(TAG, "SCD40 CRC error for humidity");
        return ESP_ERR_INVALID_CRC;
    }

    // Parse data
    *co2 = (data[0] << 8) | data[1];
    uint16_t temp_raw = (data[3] << 8) | data[4];
    uint16_t hum_raw = (data[6] << 8) | data[7];

    // Convert to physical values (from SCD40 datasheet)
    *temperature = -45.0f + 175.0f * ((float)temp_raw / 65535.0f);
    *humidity = 100.0f * ((float)hum_raw / 65535.0f);

    return ESP_OK;
}

// ============================================================================
// ADDITIONAL SCD40 COMMANDS - Full API Implementation
// ============================================================================

// Helper function: Send command with data word (16-bit) and CRC
static esp_err_t scd40_send_command_with_data(uint16_t command, uint16_t data)
{
    uint8_t cmd_buf[5];
    uint8_t data_bytes[2];

    // Command bytes
    cmd_buf[0] = (command >> 8) & 0xFF;
    cmd_buf[1] = command & 0xFF;

    // Data bytes
    data_bytes[0] = (data >> 8) & 0xFF;
    data_bytes[1] = data & 0xFF;
    cmd_buf[2] = data_bytes[0];
    cmd_buf[3] = data_bytes[1];

    // CRC for data
    cmd_buf[4] = scd40_crc8(data_bytes, 2);

    esp_err_t err = i2c_master_transmit(scd40_dev_handle, cmd_buf, 5, pdMS_TO_TICKS(1000));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "SCD40 command with data 0x%04x failed: %s", command, esp_err_to_name(err));
    }
    return err;
}

// Helper function: Read single word (16-bit) with CRC verification
static esp_err_t scd40_read_word(uint16_t *value)
{
    uint8_t data[3]; // 2 bytes data + 1 byte CRC

    esp_err_t err = i2c_master_receive(scd40_dev_handle, data, 3, pdMS_TO_TICKS(1000));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to read word from SCD40: %s", esp_err_to_name(err));
        return err;
    }

    // Verify CRC
    if (scd40_crc8(&data[0], 2) != data[2]) {
        ESP_LOGE(TAG, "SCD40 CRC error reading word");
        return ESP_ERR_INVALID_CRC;
    }

    *value = (data[0] << 8) | data[1];
    return ESP_OK;
}

// ============================================================================
// ON-CHIP OUTPUT SIGNAL COMPENSATION COMMANDS
// ============================================================================

