massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1/main/app_main.cpp
// Set temperature offset (in °C)
// Temperature offset has no influence on SCD40 CO2 accuracy
// Default offset is 4°C
esp_err_t scd40_set_temperature_offset(float offset_celsius)
{
    // Convert °C to raw value: raw = (offset * 2^16) / 175
    uint16_t offset_raw = (uint16_t)((offset_celsius * 65536.0f) / 175.0f);

    ESP_LOGI(TAG, "Setting SCD40 temperature offset: %.2f°C (raw: 0x%04x)", offset_celsius, offset_raw);
    return scd40_send_command_with_data(SCD40_CMD_SET_TEMPERATURE_OFFSET, offset_raw);
}

// Get temperature offset (in °C)
esp_err_t scd40_get_temperature_offset(float *offset_celsius)
{
    esp_err_t err = scd40_send_command(SCD40_CMD_GET_TEMPERATURE_OFFSET);
    if (err != ESP_OK) return err;

    vTaskDelay(pdMS_TO_TICKS(1));

    uint16_t offset_raw;
    err = scd40_read_word(&offset_raw);
    if (err != ESP_OK) return err;

    // Convert raw to °C: offset = (raw * 175) / 2^16
    *offset_celsius = (offset_raw * 175.0f) / 65536.0f;

    ESP_LOGI(TAG, "SCD40 temperature offset: %.2f°C (raw: 0x%04x)", *offset_celsius, offset_raw);
    return ESP_OK;
}

// Set sensor altitude (in meters above sea level)
// Used for pressure compensation. Default is 0m
esp_err_t scd40_set_sensor_altitude(uint16_t altitude_meters)
{
    ESP_LOGI(TAG, "Setting SCD40 sensor altitude: %u meters", altitude_meters);
    return scd40_send_command_with_data(SCD40_CMD_SET_SENSOR_ALTITUDE, altitude_meters);
}

// Get sensor altitude (in meters above sea level)
esp_err_t scd40_get_sensor_altitude(uint16_t *altitude_meters)
{
    esp_err_t err = scd40_send_command(SCD40_CMD_GET_SENSOR_ALTITUDE);
    if (err != ESP_OK) return err;

    vTaskDelay(pdMS_TO_TICKS(1));

    err = scd40_read_word(altitude_meters);
    if (err == ESP_OK) {
        ESP_LOGI(TAG, "SCD40 sensor altitude: %u meters", *altitude_meters);
    }
    return err;
}

// Set ambient pressure (in Pascals)
// Can be called during periodic measurement for continuous pressure compensation
// Overrides altitude-based compensation
esp_err_t scd40_set_ambient_pressure(uint32_t pressure_pascal)
{
    // Convert Pa to hectopascals (hPa): 1 hPa = 100 Pa
    // Command expects pressure in hectopascals
    uint16_t pressure_hpa = (uint16_t)(pressure_pascal / 100);

    ESP_LOGI(TAG, "Setting SCD40 ambient pressure: %lu Pa (%u hPa)", pressure_pascal, pressure_hpa);
    return scd40_send_command_with_data(SCD40_CMD_SET_AMBIENT_PRESSURE, pressure_hpa);
}

// ============================================================================
// FIELD CALIBRATION COMMANDS
// ============================================================================

// Perform forced recalibration (FRC)
// target_co2_ppm: Reference CO2 concentration (typically 400 ppm for outdoor air)
// Returns: FRC correction value (ppm), or 0xFFFF if failed
esp_err_t scd40_perform_forced_recalibration(uint16_t target_co2_ppm, int16_t *frc_correction)
{
    ESP_LOGI(TAG, "Performing SCD40 forced recalibration with target: %u ppm", target_co2_ppm);

    esp_err_t err = scd40_send_command_with_data(SCD40_CMD_PERFORM_FORCED_RECALIBRATION, target_co2_ppm);
    if (err != ESP_OK) return err;

    // Wait for command execution (400ms according to datasheet)
    vTaskDelay(pdMS_TO_TICKS(400));

    uint16_t correction_raw;
    err = scd40_read_word(&correction_raw);
    if (err != ESP_OK) return err;

    if (correction_raw == 0xFFFF) {
        ESP_LOGE(TAG, "SCD40 forced recalibration FAILED");
        *frc_correction = 0;
        return ESP_FAIL;
    }

    // Convert to signed correction value
    *frc_correction = (int16_t)correction_raw - 0x8000;

    ESP_LOGI(TAG, "SCD40 forced recalibration SUCCESS. Correction: %d ppm", *frc_correction);
    return ESP_OK;
}

// Enable/disable automatic self-calibration (ASC)
// ASC is enabled by default and works when sensor is exposed to fresh air (400 ppm) at least once per week
esp_err_t scd40_set_automatic_self_calibration_enabled(bool enabled)
{
    uint16_t value = enabled ? 1 : 0;
    ESP_LOGI(TAG, "Setting SCD40 automatic self-calibration: %s", enabled ? "ENABLED" : "DISABLED");
    return scd40_send_command_with_data(SCD40_CMD_SET_AUTOMATIC_SELF_CALIBRATION_ENABLED, value);
}

// Get automatic self-calibration status
esp_err_t scd40_get_automatic_self_calibration_enabled(bool *enabled)
{
    esp_err_t err = scd40_send_command(SCD40_CMD_GET_AUTOMATIC_SELF_CALIBRATION_ENABLED);
    if (err != ESP_OK) return err;

    vTaskDelay(pdMS_TO_TICKS(1));

    uint16_t value;
    err = scd40_read_word(&value);
    if (err != ESP_OK) return err;

    *enabled = (value == 1);
    ESP_LOGI(TAG, "SCD40 automatic self-calibration: %s", *enabled ? "ENABLED" : "DISABLED");
    return ESP_OK;
}

// ============================================================================
// LOW POWER COMMANDS
// ============================================================================

// Start low power periodic measurement (30 second interval instead of 5 seconds)
// Saves power but has longer response time
esp_err_t scd40_start_low_power_periodic_measurement(void)
{
    ESP_LOGI(TAG, "Starting SCD40 low power periodic measurement (30s interval)");
    return scd40_send_command(SCD40_CMD_START_LOW_POWER_PERIODIC_MEASUREMENT);
}

// Get data ready status
// Returns: true if data is ready to be read
esp_err_t scd40_get_data_ready_status(bool *data_ready)
{
    esp_err_t err = scd40_send_command(SCD40_CMD_GET_DATA_READY_STATUS);
    if (err != ESP_OK) return err;

    vTaskDelay(pdMS_TO_TICKS(1));

    uint16_t status;
    err = scd40_read_word(&status);
    if (err != ESP_OK) return err;

    // Data is ready if last 11 bits are NOT all 0
    *data_ready = ((status & 0x07FF) != 0);

    return ESP_OK;
}

// ============================================================================
// ADVANCED FEATURES COMMANDS
// ============================================================================

// Persist settings to EEPROM
// Saves temperature offset, sensor altitude, and ASC enabled/disabled state
// EEPROM is guaranteed for at least 2000 write cycles
esp_err_t scd40_persist_settings(void)
{
    ESP_LOGI(TAG, "Persisting SCD40 settings to EEPROM...");
    esp_err_t err = scd40_send_command(SCD40_CMD_PERSIST_SETTINGS);
    if (err == ESP_OK) {
        // Wait for command execution (800ms according to datasheet)
        vTaskDelay(pdMS_TO_TICKS(800));
        ESP_LOGI(TAG, "SCD40 settings persisted successfully");
    }
    return err;
}

// Get serial number
// Returns 48-bit serial number
esp_err_t scd40_get_serial_number(uint64_t *serial_number)
{
    esp_err_t err = scd40_send_command(SCD40_CMD_GET_SERIAL_NUMBER);
    if (err != ESP_OK) return err;

    vTaskDelay(pdMS_TO_TICKS(1));

