massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1/main/app_main.cpp
    uint8_t data[9]; // 3 words: 2 bytes + CRC each
    err = i2c_master_receive(scd40_dev_handle, data, 9, pdMS_TO_TICKS(1000));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to read SCD40 serial number: %s", esp_err_to_name(err));
        return err;
    }

    // Verify CRC for each word
    if (scd40_crc8(&data[0], 2) != data[2] ||
        scd40_crc8(&data[3], 2) != data[5] ||
        scd40_crc8(&data[6], 2) != data[8]) {
        ESP_LOGE(TAG, "SCD40 CRC error reading serial number");
        return ESP_ERR_INVALID_CRC;
    }

    // Combine 3 words into 48-bit serial number
    uint64_t word0 = ((uint64_t)data[0] << 8) | data[1];
    uint64_t word1 = ((uint64_t)data[3] << 8) | data[4];
    uint64_t word2 = ((uint64_t)data[6] << 8) | data[7];

    *serial_number = (word0 << 32) | (word1 << 16) | word2;

    ESP_LOGI(TAG, "SCD40 Serial Number: 0x%012llX", *serial_number);
    return ESP_OK;
}

// Perform self-test
// Returns: true if no malfunction detected
esp_err_t scd40_perform_self_test(bool *test_passed)
{
    ESP_LOGI(TAG, "Performing SCD40 self-test (takes ~5.5 seconds)...");

    esp_err_t err = scd40_send_command(SCD40_CMD_PERFORM_SELF_TEST);
    if (err != ESP_OK) return err;

    // Wait for command execution (5500ms according to datasheet)
    vTaskDelay(pdMS_TO_TICKS(5500));

    uint16_t result;
    err = scd40_read_word(&result);
    if (err != ESP_OK) return err;

    *test_passed = (result == 0);

    if (*test_passed) {
        ESP_LOGI(TAG, "SCD40 self-test PASSED");
    } else {
        ESP_LOGE(TAG, "SCD40 self-test FAILED (result: 0x%04x)", result);
    }

    return ESP_OK;
}

// Perform factory reset
// Resets all configuration settings and erases FRC and ASC history
esp_err_t scd40_perform_factory_reset(void)
{
    ESP_LOGW(TAG, "Performing SCD40 factory reset - all settings will be erased!");

    esp_err_t err = scd40_send_command(SCD40_CMD_PERFORM_FACTORY_RESET);
    if (err == ESP_OK) {
        // Wait for command execution (1200ms according to datasheet)
        vTaskDelay(pdMS_TO_TICKS(1200));
        ESP_LOGI(TAG, "SCD40 factory reset complete");
    }
    return err;
}

// Reinitialize sensor
// Reloads user settings from EEPROM
// Must be in idle mode (stop periodic measurement first)
esp_err_t scd40_reinit(void)
{
    ESP_LOGI(TAG, "Reinitializing SCD40 sensor...");

    esp_err_t err = scd40_send_command(SCD40_CMD_REINIT);
    if (err == ESP_OK) {
        // Wait for command execution (20ms according to datasheet)
        vTaskDelay(pdMS_TO_TICKS(20));
        ESP_LOGI(TAG, "SCD40 reinitialized successfully");
    }
    return err;
}

// ============================================================================
// LOW POWER SINGLE SHOT COMMANDS (SCD41 only)
// ============================================================================

// Measure single shot (on-demand measurement)
// Measures CO2, temperature, and humidity
// SCD41 only - takes ~1.35 seconds
esp_err_t scd40_measure_single_shot(void)
{
    ESP_LOGI(TAG, "SCD40/41 single shot measurement (takes ~1.35s)");

    esp_err_t err = scd40_send_command(SCD40_CMD_MEASURE_SINGLE_SHOT);
    if (err == ESP_OK) {
        // Wait for measurement (1350ms according to datasheet)
        vTaskDelay(pdMS_TO_TICKS(1350));
    }
    return err;
}

// Measure single shot - RH and T only (no CO2)
// SCD41 only - takes ~50ms
// CO2 output will be 0 ppm
esp_err_t scd40_measure_single_shot_rht_only(void)
{
    ESP_LOGI(TAG, "SCD40/41 single shot RH/T measurement (takes ~50ms)");

    esp_err_t err = scd40_send_command(SCD40_CMD_MEASURE_SINGLE_SHOT_RHT_ONLY);
    if (err == ESP_OK) {
        // Wait for measurement (50ms according to datasheet)
        vTaskDelay(pdMS_TO_TICKS(50));
    }
    return err;
}

// ============================================================================
// END OF SCD40 ADDITIONAL COMMANDS
// ============================================================================

// Configure antenna selection for XIAO ESP32C6
static void configure_antenna(void)
{
    // Configure GPIO3 (WIFI_ENABLE) - must be LOW to enable RF switch control
    gpio_config_t ant_enable_conf = {};
    ant_enable_conf.intr_type = GPIO_INTR_DISABLE;
    ant_enable_conf.mode = GPIO_MODE_OUTPUT;
    ant_enable_conf.pin_bit_mask = (1ULL << GPIO_WIFI_ENABLE);
    ant_enable_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    ant_enable_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&ant_enable_conf);
    gpio_set_level(GPIO_WIFI_ENABLE, 0);  // Set LOW to activate RF switch

    // Small delay for RF switch activation
    vTaskDelay(pdMS_TO_TICKS(10));

    // Configure WIFI_ANT_CONFIG GPIO - antenna selection
    gpio_config_t ant_config_conf = {};
    ant_config_conf.intr_type = GPIO_INTR_DISABLE;
    ant_config_conf.mode = GPIO_MODE_OUTPUT;
    ant_config_conf.pin_bit_mask = (1ULL << GPIO_WIFI_ANT_CONFIG);
    ant_config_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    ant_config_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&ant_config_conf);

#if USE_EXTERNAL_ANTENNA
    gpio_set_level(GPIO_WIFI_ANT_CONFIG, 1);  // HIGH = External antenna (UFL)
    ESP_LOGI(TAG, "Antenna configured: EXTERNAL (UFL connector)");
#else
    gpio_set_level(GPIO_WIFI_ANT_CONFIG, 0);  // LOW = Internal ceramic antenna
    ESP_LOGI(TAG, "Antenna configured: INTERNAL (ceramic)");
#endif
}

// Switch antenna at runtime (call this function to change antenna)
void switch_antenna(bool use_external)
{
    if (use_external) {
        gpio_set_level(GPIO_WIFI_ANT_CONFIG, 1);  // HIGH = External antenna
        ESP_LOGI(TAG, "Switched to EXTERNAL antenna (UFL)");
    } else {
        gpio_set_level(GPIO_WIFI_ANT_CONFIG, 0);  // LOW = Internal antenna
        ESP_LOGI(TAG, "Switched to INTERNAL antenna (ceramic)");
    }
}

// ==============================================================================
// NVS Helper Functions for SCD40 Configuration Persistence
// ==============================================================================

