massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1/main/app_main.cpp
                scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);

                // Auto-reset switch to OFF
                val->val.b = false;
                attribute::update(endpoint_id, cluster_id, attribute_id, val);
            }

            // Enable/Disable Automatic Self-Calibration
            if (endpoint_id == scd40_asc_enable_endpoint_id) {
                ESP_LOGI(TAG, "OpenHAB: Set SCD40 ASC %s", val->val.b ? "ENABLED" : "DISABLED");
                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                scd40_set_automatic_self_calibration_enabled(val->val.b);

                scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);
            }

            // Switch Low Power Mode
            if (endpoint_id == scd40_low_power_endpoint_id) {
                ESP_LOGI(TAG, "OpenHAB: Set SCD40 %s mode", val->val.b ? "LOW POWER" : "NORMAL");
                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                if (val->val.b) {
                    scd40_start_low_power_periodic_measurement();  // 30s interval
                } else {
                    scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);  // 5s interval
                }
            }

            // Trigger Persist Settings
            if (endpoint_id == scd40_persist_endpoint_id && val->val.b) {
                ESP_LOGI(TAG, "OpenHAB: Trigger SCD40 persist settings to EEPROM");
                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                scd40_persist_settings();

                scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);

                // Auto-reset switch to OFF
                val->val.b = false;
                attribute::update(endpoint_id, cluster_id, attribute_id, val);
            }

            // Trigger Self Test
            if (endpoint_id == scd40_self_test_endpoint_id && val->val.b) {
                ESP_LOGI(TAG, "OpenHAB: Trigger SCD40 self-test (takes 5.5 seconds)");
                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                bool test_passed;
                esp_err_t err = scd40_perform_self_test(&test_passed);
                if (err == ESP_OK) {
                    ESP_LOGI(TAG, "Self-test: %s", test_passed ? "PASSED" : "FAILED");
                }

                scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);

                // Auto-reset switch to OFF
                val->val.b = false;
                attribute::update(endpoint_id, cluster_id, attribute_id, val);
            }
        }

        // On/Off cluster (for altitude and temperature offset virtual dimmers)
        // Matter automatically tries to set on/off when level changes - handle it gracefully
        if (cluster_id == OnOff::Id && attribute_id == OnOff::Attributes::OnOff::Id) {
            if (endpoint_id == scd40_altitude_endpoint_id || endpoint_id == scd40_temp_offset_endpoint_id) {
                // These are virtual dimmers - always keep them "on", silently ignore state changes
                return ESP_OK;
            }
        }

        // Level Control cluster (for altitude and temperature offset)
        if (cluster_id == LevelControl::Id && attribute_id == LevelControl::Attributes::CurrentLevel::Id) {
            if (!scd40_available) {
                ESP_LOGW(TAG, "SCD40 not available - ignoring command");
                return ESP_OK;
            }

            // IMPORTANT: Ignore attribute updates during boot initialization
            // This prevents Matter SDK from overwriting EEPROM values with defaults
            if (!device_initialization_complete) {
                ESP_LOGD(TAG, "Ignoring Level Control update during boot initialization (endpoint %u, level %u)",
                         endpoint_id, val->val.u8);
                return ESP_OK;
            }

            // Set Altitude (0-5000 meters, mapped to 1-255 level)
            if (endpoint_id == scd40_altitude_endpoint_id) {
                // Map level (1-255) to altitude (0-5000m): level 1=0m, level 255=5000m
                uint16_t altitude = ((val->val.u8 - 1) * 5000) / 254;
                ESP_LOGI(TAG, "OpenHAB: Set SCD40 altitude %u meters", altitude);

                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                scd40_set_sensor_altitude(altitude);

                scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);

                // Save immediately to NVS for persistence across reboots
                nvs_save_altitude(altitude);

                return ESP_OK;
            }

            // Set Temperature Offset (0-10°C, mapped to 1-255 level)
            if (endpoint_id == scd40_temp_offset_endpoint_id) {
                // Map level (1-255) to offset (0-10°C): level 1=0°C, level 255=10°C
                float offset = ((val->val.u8 - 1) * 10.0f) / 254.0f;
                ESP_LOGI(TAG, "OpenHAB: Set SCD40 temperature offset %.2f°C", offset);

                scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
                vTaskDelay(pdMS_TO_TICKS(500));

                scd40_set_temperature_offset(offset);

                scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);

                // Save immediately to NVS for persistence across reboots
                nvs_save_temp_offset(offset);

                return ESP_OK;
            }
        }
    }
    return ESP_OK;
}

// Identification callback
static esp_err_t app_identification_cb(identification::callback_type_t type,
                                       uint16_t endpoint_id, uint8_t effect_id,
                                       uint8_t effect_variant, void *priv_data)
{
    ESP_LOGI(TAG, "Identification callback: type=%u, endpoint=%u", type, endpoint_id);
    return ESP_OK;
}

// GPIO input monitoring task
// Monitors 4 independent inputs and reports state changes via Matter
static void gpio_input_task(void *arg)
{
    bool last_states[4] = {true, true, true, true};  // Assume pull-up, initial HIGH
    bool current_state;
    bool inverted_state;

    while (1) {
        // Monitor all 4 inputs
        for (int i = 0; i < 4; i++) {
            current_state = gpio_get_level(input_pins[i]);

            // Detect state change
            if (current_state != last_states[i]) {
                // Invert logic: HIGH (pull-up open) = false (closed), LOW (contact) = true (open)
                inverted_state = !current_state;

