massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1/main/app_main.cpp
                ESP_LOGI(TAG, "Input %d (GPIO%d) changed to %s", i + 1, input_pins[i],
                         inverted_state ? "OPEN" : "CLOSED");

                // Update Matter Boolean State attribute
                node_t *node = node::get();
                endpoint_t *endpoint = endpoint::get(node, input_endpoint_ids[i]);

                // Use BooleanState cluster to report contact sensor state
                // StateValue inverted: HIGH (open physically) = false (closed in Matter)
                cluster_t *cluster = cluster::get(endpoint, BooleanState::Id);
                if (cluster) {
                    attribute_t *attribute = attribute::get(cluster, BooleanState::Attributes::StateValue::Id);
                    if (attribute) {
                        esp_matter_attr_val_t val;
                        val.type = ESP_MATTER_VAL_TYPE_BOOLEAN;
                        val.val.b = inverted_state;  // Inverted: LOW = true (open), HIGH = false (closed)
                        attribute::update(input_endpoint_ids[i], BooleanState::Id,
                                         BooleanState::Attributes::StateValue::Id, &val);
                    }
                }

                last_states[i] = current_state;
            }
        }

        vTaskDelay(pdMS_TO_TICKS(50));  // 50ms polling interval with debounce
    }
}

// SCD40 sensor reading task
// Reads CO2, temperature, and humidity every 5 seconds and updates Matter attributes
static void scd40_sensor_task(void *arg)
{
    ESP_LOGI(TAG, "SCD40 sensor task started");

    // Check if sensor is available
    if (!scd40_available) {
        ESP_LOGW(TAG, "SCD40 sensor not available - task will not read sensor");
        ESP_LOGI(TAG, "SCD40 sensor task terminating (sensor not connected)");
        vTaskDelete(NULL);  // Terminate task if sensor not available
        return;
    }

    // Wait for first measurement to be ready (SCD40 needs 5 seconds after start)
    vTaskDelay(pdMS_TO_TICKS(5000));

    ESP_LOGI(TAG, "SCD40 sensor task: endpoint IDs - CO2=%u, Temp=%u, Hum=%u",
             co2_endpoint_id, temperature_endpoint_id, humidity_endpoint_id);

    while (1) {
        uint16_t co2;
        float temperature, humidity;

        // Read measurement from SCD40
        esp_err_t err = scd40_read_measurement(&co2, &temperature, &humidity);

        if (err == ESP_OK) {
            // Update global variables
            scd40_co2 = co2;
            scd40_temperature = temperature;
            scd40_humidity = humidity;

            ESP_LOGI(TAG, "SCD40: CO2=%u ppm, Temp=%.2f°C, Humidity=%.2f%%RH",
                     co2, temperature, humidity);

            // Update Matter attributes
            esp_matter_attr_val_t val;

            // Update Air Quality enum (using Air Quality Instance API with proper locking)
            if (gAirQualityInstance) {
                uint8_t air_quality_val = calculate_air_quality_from_co2(co2);
                chip::app::Clusters::AirQuality::AirQualityEnum air_quality_enum;

                // Convert uint8_t to AirQualityEnum
                switch (air_quality_val) {
                    case 0x01: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kGood; break;
                    case 0x02: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kFair; break;
                    case 0x03: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kModerate; break;
                    case 0x04: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kPoor; break;
                    case 0x05: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kVeryPoor; break;
                    case 0x06: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kExtremelyPoor; break;
                    default: air_quality_enum = chip::app::Clusters::AirQuality::AirQualityEnum::kUnknown; break;
                }

                // Acquire Matter stack lock before updating Air Quality
                chip::DeviceLayer::PlatformMgr().LockChipStack();
                auto status = gAirQualityInstance->UpdateAirQuality(air_quality_enum);
                chip::DeviceLayer::PlatformMgr().UnlockChipStack();

                if (status == chip::Protocols::InteractionModel::Status::Success) {
                    ESP_LOGI(TAG, "Air Quality updated to: %u (CO2: %u ppm)", air_quality_val, co2);
                } else {
                    ESP_LOGW(TAG, "Failed to update Air Quality: status %d", static_cast<int>(status));
                }
            }

            // Update CO2 concentration value (cluster 0x040D)
            if (co2_endpoint_id != 0) {
                val.type = ESP_MATTER_VAL_TYPE_NULLABLE_FLOAT;
                val.val.f = (float)co2;  // CO2 PPM value (400-5000 range)
                esp_err_t err_co2 = attribute::update(co2_endpoint_id,
                                 CarbonDioxideConcentrationMeasurement::Id,
                                 CarbonDioxideConcentrationMeasurement::Attributes::MeasuredValue::Id,
                                 &val);
                if (err_co2 != ESP_OK) {
                    ESP_LOGW(TAG, "Failed to update CO2 concentration attribute: %s", esp_err_to_name(err_co2));
                }
            }

            // Update Temperature attribute (in °C * 100 for Matter)
            if (temperature_endpoint_id != 0) {
                val.type = ESP_MATTER_VAL_TYPE_NULLABLE_INT16;
                val.val.i16 = (int16_t)(temperature * 100);
                esp_err_t err_temp = attribute::update(temperature_endpoint_id,
                                 TemperatureMeasurement::Id,
                                 TemperatureMeasurement::Attributes::MeasuredValue::Id,
                                 &val);
                if (err_temp != ESP_OK) {
                    ESP_LOGW(TAG, "Failed to update temperature attribute: %s", esp_err_to_name(err_temp));
                }
            }

            // Update Humidity attribute (in %RH * 100 for Matter)
            if (humidity_endpoint_id != 0) {
                val.type = ESP_MATTER_VAL_TYPE_NULLABLE_UINT16;
                val.val.u16 = (uint16_t)(humidity * 100);
                esp_err_t err_hum = attribute::update(humidity_endpoint_id,
                                 RelativeHumidityMeasurement::Id,
                                 RelativeHumidityMeasurement::Attributes::MeasuredValue::Id,
                                 &val);
                if (err_hum != ESP_OK) {
                    ESP_LOGW(TAG, "Failed to update humidity attribute: %s", esp_err_to_name(err_hum));
                }
            }
        } else {
            ESP_LOGW(TAG, "Failed to read SCD40 measurement");
        }

        // SCD40 provides new data every 5 seconds
        vTaskDelay(pdMS_TO_TICKS(5000));
    }
}

// ==============================================================================
// SCD40 Configuration Sync Task
// ==============================================================================
// Syncs altitude and temperature offset values from EEPROM to OpenHAB after boot
// Delayed to ensure Matter connection is fully established
static void scd40_config_sync_task(void *arg)
{
    // Wait 10 seconds for Matter/Thread connection to stabilize
    ESP_LOGI(TAG, "SCD40 config sync task started - waiting 10s for Matter connection...");
    vTaskDelay(pdMS_TO_TICKS(10000));

    if (!scd40_available) {
        ESP_LOGI(TAG, "SCD40 not available - skipping config sync");
        vTaskDelete(NULL);
        return;
    }

    ESP_LOGI(TAG, "Syncing SCD40 configuration to OpenHAB...");

    // Update altitude attribute (Level Control cluster)
    if (scd40_altitude_endpoint_id != 0) {
        uint8_t altitude_level = (uint8_t)(((loaded_altitude_meters * 254) + 2500) / 5000) + 1;
        esp_matter_attr_val_t altitude_val = esp_matter_invalid(NULL);
        altitude_val.type = ESP_MATTER_VAL_TYPE_NULLABLE_UINT8;
        altitude_val.val.u8 = altitude_level;

        esp_err_t err = attribute::update(scd40_altitude_endpoint_id,
                        LevelControl::Id,
                        LevelControl::Attributes::CurrentLevel::Id,
                        &altitude_val);

        if (err == ESP_OK) {
            ESP_LOGI(TAG, "→ OpenHAB: Synced altitude %um (level %u)", loaded_altitude_meters, altitude_level);
        } else {
            ESP_LOGW(TAG, "Failed to sync altitude: %s", esp_err_to_name(err));
        }
    }

    // Update temperature offset attribute (Level Control cluster)
    if (scd40_temp_offset_endpoint_id != 0) {
        uint8_t temp_offset_level = (uint8_t)(((loaded_temp_offset_celsius * 254.0f) + 5.0f) / 10.0f) + 1;
        esp_matter_attr_val_t temp_offset_val = esp_matter_invalid(NULL);
        temp_offset_val.type = ESP_MATTER_VAL_TYPE_NULLABLE_UINT8;
        temp_offset_val.val.u8 = temp_offset_level;

        esp_err_t err = attribute::update(scd40_temp_offset_endpoint_id,
                        LevelControl::Id,
                        LevelControl::Attributes::CurrentLevel::Id,
                        &temp_offset_val);

        if (err == ESP_OK) {
            ESP_LOGI(TAG, "→ OpenHAB: Synced temp offset %.2f°C (level %u)", loaded_temp_offset_celsius, temp_offset_level);
        } else {
            ESP_LOGW(TAG, "Failed to sync temp offset: %s", esp_err_to_name(err));
        }
    }

    ESP_LOGI(TAG, "✓ SCD40 configuration synced to OpenHAB");

    // Task completes - delete itself
    vTaskDelete(NULL);
}

