massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1/main/app_main.cpp
#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
// Thread role monitoring task - Controls status LED
// LED patterns indicate Thread device role in mesh network
static void thread_status_led_task(void *arg)
{
    otDeviceRole last_role = OT_DEVICE_ROLE_DISABLED;

    ESP_LOGI(TAG, "Thread status LED task started on GPIO%d", GPIO_STATUS_LED);

    while (1) {
        // Get OpenThread instance
        otInstance *instance = esp_openthread_get_instance();
        if (instance) {
            otDeviceRole role = otThreadGetDeviceRole(instance);

            // Log role changes
            if (role != last_role) {
                const char *role_str = "UNKNOWN";
                switch (role) {
                    case OT_DEVICE_ROLE_DISABLED:  role_str = "DISABLED"; break;
                    case OT_DEVICE_ROLE_DETACHED:  role_str = "DETACHED"; break;
                    case OT_DEVICE_ROLE_CHILD:     role_str = "END DEVICE (Child)"; break;
                    case OT_DEVICE_ROLE_ROUTER:    role_str = "ROUTER"; break;
                    case OT_DEVICE_ROLE_LEADER:    role_str = "LEADER (Router)"; break;
                }
                ESP_LOGI(TAG, "Thread role changed: %s", role_str);
                last_role = role;
            }

            // Determine LED pattern based on role
            switch (role) {
                case OT_DEVICE_ROLE_DISABLED:
                case OT_DEVICE_ROLE_DETACHED:
                    // Not connected - LED OFF
                    gpio_set_level(GPIO_STATUS_LED, 0);
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    break;

                case OT_DEVICE_ROLE_CHILD:
                    // End Device (no routing) - LED ON (solid)
                    gpio_set_level(GPIO_STATUS_LED, 1);
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    break;

                case OT_DEVICE_ROLE_ROUTER:
                    // Router - Single blink (250ms ON, 750ms OFF = 1 second cycle)
                    gpio_set_level(GPIO_STATUS_LED, 1);
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    gpio_set_level(GPIO_STATUS_LED, 0);
                    vTaskDelay(pdMS_TO_TICKS(250));
                    break;

                case OT_DEVICE_ROLE_LEADER:
                    // Leader - Double blink (200ms ON, 200ms OFF, 200ms ON, 600ms OFF = 1200ms cycle)
                    // First blink
                    gpio_set_level(GPIO_STATUS_LED, 0);
                    vTaskDelay(pdMS_TO_TICKS(250));
                    gpio_set_level(GPIO_STATUS_LED, 1);
                    vTaskDelay(pdMS_TO_TICKS(200));
                    // Second blink
                    gpio_set_level(GPIO_STATUS_LED, 0);
                    vTaskDelay(pdMS_TO_TICKS(250));
                    gpio_set_level(GPIO_STATUS_LED, 1);
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    break;

                default:
                    // Unknown - Fast blink
                    gpio_set_level(GPIO_STATUS_LED, 1);
                    vTaskDelay(pdMS_TO_TICKS(100));
                    gpio_set_level(GPIO_STATUS_LED, 0);
                    vTaskDelay(pdMS_TO_TICKS(100));
                    break;
            }
        } else {
            // OpenThread not available - LED OFF
            gpio_set_level(GPIO_STATUS_LED, 0);
            vTaskDelay(pdMS_TO_TICKS(1000));
        }
    }
}
#endif // CHIP_DEVICE_CONFIG_ENABLE_THREAD

extern "C" void app_main()
{
    // EARLY DEBUG: Test USB Serial output immediately
    printf("\n\n");
    printf("==============================================\n");
    printf("ESP32C6 XIAO - USB SERIAL TEST\n");
    printf("==============================================\n");
    printf("If you see this, USB Serial is working!\n\n");

    esp_err_t err = ESP_OK;

    // Initialize NVS
    err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(err);

    // Set custom Vendor Name and Product Name in NVS BEFORE Matter starts
    const char *vendor_name = "VicinoDiCasaDigitale";
    const char *product_name = "Matter Thread 4in/2out+SCD40";

    chip::DeviceLayer::Internal::ESP32Config::WriteConfigValueStr(
        chip::DeviceLayer::Internal::ESP32Config::kConfigKey_VendorName, vendor_name);
    chip::DeviceLayer::Internal::ESP32Config::WriteConfigValueStr(
        chip::DeviceLayer::Internal::ESP32Config::kConfigKey_ProductName, product_name);

    ESP_LOGI(TAG, "Device info configured in NVS: Vendor=%s, Product=%s", vendor_name, product_name);

    // Configure antenna (XIAO ESP32C6 specific - must be done BEFORE radio operations)
    configure_antenna();

    // Initialize I2C for SCD40 sensor (optional - allows boot without sensor)
    err = i2c_master_init();
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "I2C initialization failed - SCD40 sensor disabled");
        ESP_LOGW(TAG, "Device will continue without CO2/Temperature/Humidity sensor");
        scd40_available = false;
    } else {
        // Initialize SCD40 sensor only if I2C works
        err = scd40_init();
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "SCD40 sensor initialization failed - sensor disabled");
            ESP_LOGW(TAG, "Device will continue without CO2/Temperature/Humidity sensor");
            scd40_available = false;
        } else {
            ESP_LOGI(TAG, "SCD40 sensor initialized successfully");
            scd40_available = true;
        }
    }

    // Configure GPIOs
    gpio_config_t io_conf = {};

    // Configure 2 outputs (GPIO19, GPIO20)
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_OUTPUT;
    io_conf.pin_bit_mask = (1ULL << GPIO_OUTPUT_0) | (1ULL << GPIO_OUTPUT_1);
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&io_conf);

    // Initialize all outputs to LOW
    for (int i = 0; i < 2; i++) {
        gpio_set_level(output_pins[i], 0);
    }

    // Configure 4 inputs (D0-D3)
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pin_bit_mask = (1ULL << GPIO_INPUT_0) | (1ULL << GPIO_INPUT_1) |
                           (1ULL << GPIO_INPUT_2) | (1ULL << GPIO_INPUT_3);
    io_conf.pull_up_en = GPIO_PULLUP_ENABLE;
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    gpio_config(&io_conf);

    // Configure Status LED (USER LED on GPIO15)
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_OUTPUT;
    io_conf.pin_bit_mask = (1ULL << GPIO_STATUS_LED);
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&io_conf);
    gpio_set_level(GPIO_STATUS_LED, 0);  // Initially OFF

