massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1/main/app_main.cpp
    ESP_LOGI(TAG, "GPIOs configured:");
    ESP_LOGI(TAG, "  Inputs: GPIO%d, %d, %d, %d",
             GPIO_INPUT_0, GPIO_INPUT_1, GPIO_INPUT_2, GPIO_INPUT_3);
    ESP_LOGI(TAG, "  Outputs: GPIO%d, %d",
             GPIO_OUTPUT_0, GPIO_OUTPUT_1);
    ESP_LOGI(TAG, "  I2C: SDA=GPIO%d, SCL=GPIO%d", I2C_MASTER_SDA_IO, I2C_MASTER_SCL_IO);
    ESP_LOGI(TAG, "  Status LED: GPIO%d (Thread role indicator)", GPIO_STATUS_LED);

    // Create Matter node
    node::config_t node_config;
    node_t *node = node::create(&node_config, app_attribute_update_cb, app_identification_cb);
    if (!node) {
        ESP_LOGE(TAG, "Failed to create Matter node");
        return;
    }

    ESP_LOGI(TAG, "Creating Matter endpoints...");

    // Create 4 Input Endpoints (Contact Sensors)
    for (int i = 0; i < 4; i++) {
        contact_sensor::config_t sensor_config;
        // With pull-up: HIGH=open, we report as false (contact/closed)
        sensor_config.boolean_state.state_value = false;  // Initial state: closed (HIGH with pull-up inverted)

        endpoint_t *input_endpoint = contact_sensor::create(node, &sensor_config, ENDPOINT_FLAG_NONE, NULL);
        if (!input_endpoint) {
            ESP_LOGE(TAG, "Failed to create input endpoint %d", i + 1);
            return;
        }

        input_endpoint_ids[i] = endpoint::get_id(input_endpoint);
        ESP_LOGI(TAG, "Input %d (GPIO%d) endpoint created with id %u",
                 i + 1, input_pins[i], input_endpoint_ids[i]);
    }

    // Create 2 Output Endpoints (On/Off Lights)
    for (int i = 0; i < 2; i++) {
        on_off_light::config_t light_config;
        light_config.on_off.on_off = false;  // Initial state: OFF
        light_config.on_off_lighting.start_up_on_off = nullptr;

        endpoint_t *output_endpoint = on_off_light::create(node, &light_config, ENDPOINT_FLAG_NONE, NULL);
        if (!output_endpoint) {
            ESP_LOGE(TAG, "Failed to create output endpoint %d", i + 1);
            return;
        }

        output_endpoint_ids[i] = endpoint::get_id(output_endpoint);
        ESP_LOGI(TAG, "Output %d (GPIO%d) endpoint created with id %u",
                 i + 1, output_pins[i], output_endpoint_ids[i]);
    }

    // Create SCD40 sensor endpoints only if sensor is available
    if (scd40_available) {
        ESP_LOGI(TAG, "Creating SCD40 sensor endpoints (Air Quality with CO2, Temperature, Humidity)...");

        // Create Air Quality Sensor endpoint (device type 0x002C)
        // This endpoint will contain BOTH Air Quality enum AND CO2 PPM measurement
        air_quality_sensor::config_t air_quality_config;
        endpoint_t *air_quality_endpoint = air_quality_sensor::create(node, &air_quality_config, ENDPOINT_FLAG_NONE, NULL);
        if (!air_quality_endpoint) {
            ESP_LOGE(TAG, "Failed to create Air Quality Sensor endpoint");
            return;
        }

        air_quality_endpoint_id = endpoint::get_id(air_quality_endpoint);

        ESP_LOGI(TAG, "Air Quality Sensor endpoint created with id %u", air_quality_endpoint_id);

        // Create Air Quality Instance for programmatic control
        gAirQualityInstance = new chip::app::Clusters::AirQuality::Instance(
            air_quality_endpoint_id,
            chip::BitMask<chip::app::Clusters::AirQuality::Feature>(
                chip::app::Clusters::AirQuality::Feature::kFair,
                chip::app::Clusters::AirQuality::Feature::kModerate,
                chip::app::Clusters::AirQuality::Feature::kVeryPoor,
                chip::app::Clusters::AirQuality::Feature::kExtremelyPoor
            )
        );

        if (gAirQualityInstance) {
            CHIP_ERROR err = gAirQualityInstance->Init();
            if (err != CHIP_NO_ERROR) {
                ESP_LOGE(TAG, "Failed to initialize Air Quality Instance");
                delete gAirQualityInstance;
                gAirQualityInstance = nullptr;
            }
            // Note: Air Quality will be updated by the sensor task once readings start
        }

        // Create SEPARATE CO2 endpoint using Air Quality Sensor as base
        // Uses Carbon Dioxide Concentration Measurement cluster (0x040D) - Matter standard for CO2 sensors
        // NOTE: OpenHAB 5.1 doesn't support this cluster yet (will show NULL)
        //       OpenHAB 5.2+ will support it (PR #19897 merged Dec 27, 2025)
        //       Air Quality enum (endpoint 7) works on all versions as fallback
        air_quality_sensor::config_t co2_base_config;
        endpoint_t *co2_endpoint = air_quality_sensor::create(node, &co2_base_config, ENDPOINT_FLAG_NONE, NULL);
        if (!co2_endpoint) {
            ESP_LOGE(TAG, "Failed to create CO2 base endpoint");
            return;
        }

        // Add Carbon Dioxide Concentration Measurement cluster (0x040D)
        cluster::concentration_measurement::config_t co2_config;
        co2_config.measurement_medium = 0; // Air
        co2_config.feature_flags = cluster::concentration_measurement::feature::numeric_measurement::get_id();
        co2_config.features.numeric_measurement.measured_value = 400.0f;
        co2_config.features.numeric_measurement.min_measured_value = 400.0f;
        co2_config.features.numeric_measurement.max_measured_value = 5000.0f;
        co2_config.features.numeric_measurement.measurement_unit = 0; // PPM

        cluster_t *co2_cluster = cluster::carbon_dioxide_concentration_measurement::create(
            co2_endpoint, &co2_config, CLUSTER_FLAG_SERVER);
        if (!co2_cluster) {
            ESP_LOGE(TAG, "Failed to create CO2 concentration cluster");
            return;
        }

        co2_endpoint_id = endpoint::get_id(co2_endpoint);
        ESP_LOGI(TAG, "CO2 endpoint created with id %u (cluster 0x040D - requires OpenHAB 5.2+)", co2_endpoint_id);

        // Create Temperature Sensor Endpoint
        temperature_sensor::config_t temp_config;
        temp_config.temperature_measurement.measured_value = 2000; // 20.00°C initial
        temp_config.temperature_measurement.min_measured_value = -4000; // -40.00°C
        temp_config.temperature_measurement.max_measured_value = 12500; // 125.00°C

