massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1/main/app_main.cpp
        endpoint_t *temp_endpoint = temperature_sensor::create(node, &temp_config, ENDPOINT_FLAG_NONE, NULL);
        if (!temp_endpoint) {
            ESP_LOGE(TAG, "Failed to create temperature sensor endpoint");
            return;
        }

        temperature_endpoint_id = endpoint::get_id(temp_endpoint);
        ESP_LOGI(TAG, "Temperature sensor endpoint created with id %u", temperature_endpoint_id);

        // Create Humidity Sensor Endpoint
        humidity_sensor::config_t hum_config;
        hum_config.relative_humidity_measurement.measured_value = 5000; // 50.00%RH initial
        hum_config.relative_humidity_measurement.min_measured_value = (uint16_t)0; // 0.00%RH
        hum_config.relative_humidity_measurement.max_measured_value = (uint16_t)10000; // 100.00%RH

        endpoint_t *hum_endpoint = humidity_sensor::create(node, &hum_config, ENDPOINT_FLAG_NONE, NULL);
        if (!hum_endpoint) {
            ESP_LOGE(TAG, "Failed to create humidity sensor endpoint");
            return;
        }

        humidity_endpoint_id = endpoint::get_id(hum_endpoint);
        ESP_LOGI(TAG, "Humidity sensor endpoint created with id %u", humidity_endpoint_id);

        // ==================================================================
        // Create SCD40 Control Endpoints (Virtual switches for OpenHAB)
        // ==================================================================
        ESP_LOGI(TAG, "Creating SCD40 control endpoints for OpenHAB...");

        // 1. Trigger Forced Calibration (On/Off Light - momentary switch)
        on_off_light::config_t calibrate_config;
        calibrate_config.on_off.on_off = false;
        calibrate_config.on_off_lighting.start_up_on_off = nullptr;

        endpoint_t *calibrate_endpoint = on_off_light::create(node, &calibrate_config, ENDPOINT_FLAG_NONE, NULL);
        if (calibrate_endpoint) {
            scd40_calibrate_endpoint_id = endpoint::get_id(calibrate_endpoint);
            ESP_LOGI(TAG, "SCD40 Calibrate switch created with id %u", scd40_calibrate_endpoint_id);
        }

        // 2. ASC Enable/Disable (On/Off Light - persistent switch)
        on_off_light::config_t asc_config;
        asc_config.on_off.on_off = true;  // ASC enabled by default
        asc_config.on_off_lighting.start_up_on_off = nullptr;

        endpoint_t *asc_endpoint = on_off_light::create(node, &asc_config, ENDPOINT_FLAG_NONE, NULL);
        if (asc_endpoint) {
            scd40_asc_enable_endpoint_id = endpoint::get_id(asc_endpoint);
            ESP_LOGI(TAG, "SCD40 ASC Enable switch created with id %u", scd40_asc_enable_endpoint_id);
        }

        // 3. Low Power Mode (On/Off Light - persistent switch)
        on_off_light::config_t low_power_config;
        low_power_config.on_off.on_off = false;  // Normal mode by default
        low_power_config.on_off_lighting.start_up_on_off = nullptr;

        endpoint_t *low_power_endpoint = on_off_light::create(node, &low_power_config, ENDPOINT_FLAG_NONE, NULL);
        if (low_power_endpoint) {
            scd40_low_power_endpoint_id = endpoint::get_id(low_power_endpoint);
            ESP_LOGI(TAG, "SCD40 Low Power switch created with id %u", scd40_low_power_endpoint_id);
        }

        // 4. Trigger Persist Settings (On/Off Light - momentary switch)
        on_off_light::config_t persist_config;
        persist_config.on_off.on_off = false;
        persist_config.on_off_lighting.start_up_on_off = nullptr;

        endpoint_t *persist_endpoint = on_off_light::create(node, &persist_config, ENDPOINT_FLAG_NONE, NULL);
        if (persist_endpoint) {
            scd40_persist_endpoint_id = endpoint::get_id(persist_endpoint);
            ESP_LOGI(TAG, "SCD40 Persist Settings switch created with id %u", scd40_persist_endpoint_id);
        }

        // 5. Trigger Self Test (On/Off Light - momentary switch)
        on_off_light::config_t self_test_config;
        self_test_config.on_off.on_off = false;
        self_test_config.on_off_lighting.start_up_on_off = nullptr;

        endpoint_t *self_test_endpoint = on_off_light::create(node, &self_test_config, ENDPOINT_FLAG_NONE, NULL);
        if (self_test_endpoint) {
            scd40_self_test_endpoint_id = endpoint::get_id(self_test_endpoint);
            ESP_LOGI(TAG, "SCD40 Self Test switch created with id %u", scd40_self_test_endpoint_id);
        }

        // ==============================================================================
        // Load saved values - Priority: SCD40 EEPROM > NVS > Defaults
        // ==============================================================================
        // Strategy:
        // 1. Try to read from SCD40 EEPROM (persistent across ESP32 resets/reflash)
        // 2. If EEPROM values found, use them and sync to NVS
        // 3. If EEPROM read fails, fallback to NVS
        // 4. If NVS also empty, use factory defaults
        // ==============================================================================

        ESP_LOGI(TAG, "Reading configuration from SCD40 EEPROM...");

        // Stop periodic measurement to allow EEPROM read
        scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
        vTaskDelay(pdMS_TO_TICKS(500));

        // Try to read altitude from SCD40 EEPROM
        uint16_t eeprom_altitude = 0;
        uint16_t saved_altitude_meters = 0;
        bool altitude_from_eeprom = false;

        if (scd40_get_sensor_altitude(&eeprom_altitude) == ESP_OK) {
            saved_altitude_meters = eeprom_altitude;
            altitude_from_eeprom = true;
            ESP_LOGI(TAG, "✓ Altitude from SCD40 EEPROM: %um", saved_altitude_meters);
            // Sync to NVS for consistency
            nvs_save_altitude(saved_altitude_meters);
        } else {
            // Fallback to NVS
            if (nvs_load_altitude(&saved_altitude_meters) == ESP_OK) {
                ESP_LOGI(TAG, "Altitude from NVS: %um", saved_altitude_meters);
            } else {
                saved_altitude_meters = 0;
                ESP_LOGI(TAG, "No altitude found, using default: 0m");
            }
        }

        // Save to global for later OpenHAB sync
        loaded_altitude_meters = saved_altitude_meters;

