massimilianocasini/esp32c6_xiao/c6_matter_thread_sd40_v1/main/app_main.cpp
        // Try to read temperature offset from SCD40 EEPROM
        float eeprom_temp_offset = 0.0f;
        float saved_temp_offset_celsius = 4.0f;
        bool temp_offset_from_eeprom = false;

        if (scd40_get_temperature_offset(&eeprom_temp_offset) == ESP_OK) {
            saved_temp_offset_celsius = eeprom_temp_offset;
            temp_offset_from_eeprom = true;
            ESP_LOGI(TAG, "✓ Temp offset from SCD40 EEPROM: %.2f°C", saved_temp_offset_celsius);
            // Sync to NVS for consistency
            nvs_save_temp_offset(saved_temp_offset_celsius);
        } else {
            // Fallback to NVS
            if (nvs_load_temp_offset(&saved_temp_offset_celsius) == ESP_OK) {
                ESP_LOGI(TAG, "Temp offset from NVS: %.2f°C", saved_temp_offset_celsius);
            } else {
                saved_temp_offset_celsius = 4.0f;
                ESP_LOGI(TAG, "No temp offset found, using default: 4.0°C");
            }
        }

        // Save to global for later OpenHAB sync
        loaded_temp_offset_celsius = saved_temp_offset_celsius;

        // Restart periodic measurement (will be stopped again later to apply values)
        scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);

        ESP_LOGI(TAG, "Configuration loaded successfully (EEPROM priority: altitude=%s, temp_offset=%s)",
                 altitude_from_eeprom ? "YES" : "NO",
                 temp_offset_from_eeprom ? "YES" : "NO");

        // 6. Set Altitude (Dimmable Light with Level Control - 0-5000 meters mapped to 1-255)
        // Use saved value from NVS as initial level (with proper rounding, not truncation)
        // Formula: level = (altitude * 254 / 5000) + 1, with rounding
        uint8_t altitude_level = (uint8_t)(((saved_altitude_meters * 254) + 2500) / 5000) + 1;
        dimmable_light::config_t altitude_config;
        altitude_config.on_off.on_off = true;
        altitude_config.on_off_lighting.start_up_on_off = nullptr;
        altitude_config.level_control.current_level = altitude_level;

        endpoint_t *altitude_endpoint = dimmable_light::create(node, &altitude_config, ENDPOINT_FLAG_NONE, NULL);
        if (altitude_endpoint) {
            scd40_altitude_endpoint_id = endpoint::get_id(altitude_endpoint);
            ESP_LOGI(TAG, "SCD40 Altitude control created with id %u (initial: %um, level %u)",
                     scd40_altitude_endpoint_id, saved_altitude_meters, altitude_level);
        }

        // 7. Set Temperature Offset (Dimmable Light with Level Control - 0-10°C mapped to 1-255)
        // Use saved value from NVS as initial level (with proper rounding, not truncation)
        // Formula: level = (offset * 254 / 10) + 1, with rounding
        uint8_t temp_offset_level = (uint8_t)(((saved_temp_offset_celsius * 254.0f) + 5.0f) / 10.0f) + 1;
        dimmable_light::config_t temp_offset_config;
        temp_offset_config.on_off.on_off = true;
        temp_offset_config.on_off_lighting.start_up_on_off = nullptr;
        temp_offset_config.level_control.current_level = temp_offset_level;

        endpoint_t *temp_offset_endpoint = dimmable_light::create(node, &temp_offset_config, ENDPOINT_FLAG_NONE, NULL);
        if (temp_offset_endpoint) {
            scd40_temp_offset_endpoint_id = endpoint::get_id(temp_offset_endpoint);
            ESP_LOGI(TAG, "SCD40 Temp Offset control created with id %u (initial: %.2f°C, level %u)",
                     scd40_temp_offset_endpoint_id, saved_temp_offset_celsius, temp_offset_level);
        }

        ESP_LOGI(TAG, "All SCD40 control endpoints created successfully");

        // ==============================================================================
        // Apply loaded NVS values to SCD40 sensor
        // (Endpoints were already created with correct values above)
        // ==============================================================================
        ESP_LOGI(TAG, "Applying configuration to SCD40 sensor...");

        // Stop measurement to configure sensor
        scd40_send_command(SCD40_CMD_STOP_PERIODIC_MEASUREMENT);
        vTaskDelay(pdMS_TO_TICKS(500));

        // Apply temperature offset to sensor
        ESP_LOGI(TAG, "Setting SCD40 temperature offset: %.2f°C", saved_temp_offset_celsius);
        scd40_set_temperature_offset(saved_temp_offset_celsius);

        // Apply altitude to sensor
        ESP_LOGI(TAG, "Setting SCD40 sensor altitude: %u meters", saved_altitude_meters);
        scd40_set_sensor_altitude(saved_altitude_meters);

        // Restart periodic measurement
        scd40_send_command(SCD40_CMD_START_PERIODIC_MEASUREMENT);
        ESP_LOGI(TAG, "✓ SCD40 configuration applied and sensor restarted");

    } else {
        ESP_LOGW(TAG, "SCD40 sensor not available - skipping sensor endpoints creation");
    }

    ESP_LOGI(TAG, "All Matter endpoints created successfully");

    // Setup reset button handler
    app_reset_button_register(app_reset_to_factory);

#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
    // Set OpenThread platform config
    esp_openthread_platform_config_t config = {
        .radio_config = ESP_OPENTHREAD_DEFAULT_RADIO_CONFIG(),
        .host_config = ESP_OPENTHREAD_DEFAULT_HOST_CONFIG(),
        .port_config = ESP_OPENTHREAD_DEFAULT_PORT_CONFIG(),
    };
    set_openthread_platform_config(&config);
#endif

    // Start Matter
    err = esp_matter::start(app_event_cb);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Matter start failed: %s", esp_err_to_name(err));
        return;
    }

    ESP_LOGI(TAG, "Matter started successfully");

#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
    // Print Thread network status
    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "   THREAD NETWORK STATUS");
    ESP_LOGI(TAG, "====================================");

    auto & threadStackMgr = chip::DeviceLayer::ThreadStackMgr();
    bool isThreadProvisioned = threadStackMgr.IsThreadProvisioned();
    bool isThreadEnabled = threadStackMgr.IsThreadEnabled();
    bool isThreadAttached = threadStackMgr.IsThreadAttached();

    ESP_LOGI(TAG, "Thread Provisioned: %s", isThreadProvisioned ? "YES" : "NO");
    ESP_LOGI(TAG, "Thread Enabled: %s", isThreadEnabled ? "YES" : "NO");
    ESP_LOGI(TAG, "Thread Attached: %s", isThreadAttached ? "YES" : "NO");
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "");
#endif

    // Print commissioning information (QR code and manual pairing code)
    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "   COMMISSIONING INFORMATION");
    ESP_LOGI(TAG, "====================================");
    PrintOnboardingCodes(chip::RendezvousInformationFlag::kBLE);
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "");

    // Start GPIO input monitoring task
    xTaskCreate(gpio_input_task, "gpio_input", 4096, NULL, 5, NULL);

    // Start SCD40 sensor reading task
    xTaskCreate(scd40_sensor_task, "scd40_sensor", 4096, NULL, 5, NULL);

    // Start SCD40 configuration sync task (delayed 10s to ensure Matter connection)
    if (scd40_available) {
        xTaskCreate(scd40_config_sync_task, "scd40_sync", 4096, NULL, 5, NULL);
    }

#if CHIP_DEVICE_CONFIG_ENABLE_THREAD
    // Start Thread status LED monitoring task
    xTaskCreate(thread_status_led_task, "thread_led", 4096, NULL, 5, NULL);
#endif

    // Mark initialization as complete - now allow Matter attribute updates
    // This prevents the SDK from overwriting EEPROM values during startup
    device_initialization_complete = true;
    ESP_LOGI(TAG, "Device initialization complete - ready for operation");

    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "ESP32C6 Matter Device Started");
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "Configuration:");
    ESP_LOGI(TAG, "  - 4 Input Sensors: GPIO 0,1,2,21");
    ESP_LOGI(TAG, "  - 2 Output Controls: GPIO 19,20");
    ESP_LOGI(TAG, "  - SCD40 Sensor: I2C (SDA=GPIO22, SCL=GPIO23)");
    ESP_LOGI(TAG, "    * CO2 (ppm)");
    ESP_LOGI(TAG, "    * Temperature (°C)");
    ESP_LOGI(TAG, "    * Humidity (%%RH)");
    ESP_LOGI(TAG, "  - Status LED: GPIO 15 (Thread role indicator)");
    ESP_LOGI(TAG, "  - Protocol: Matter over Thread");
    ESP_LOGI(TAG, "====================================");
    ESP_LOGI(TAG, "");
}
